robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto - V2/app-added/can_icubProto_parser.c
            // In ICUB the states DISABLE_OPERATION and SHUTDOWN goes in the same state. 
		      // go to Ready to Switch On state
            DS402_Controlword.Flags.EnableVoltage = 0;   
            // In ICUB the states DISABLE_OPERATION and SHUTDOWN goes in the same state. 
            // go to Switched On state
            //DS402_Controlword.Flags.EnableOperation = 0;
        }break;
    
        case ICUBCANPROTO_POL_MC_CMD__ENABLE_PWM_PAD: // DS402 Switch On 
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
                //*txlen = 0x1;
                //txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen=0;
                return 0;
            }
            
            // Command can be accepted only if current ststus is SWITCH ON DISABLED 
            if(1 != DS402_Statusword.Flags.ReadyToSwitchOn )
            {
                //*txlen = 0x1;
                //txpayload->b[0] = CAN_DS402_INVALID_STATUS_CHANGE;
                *txlen=0;
                return 0;
            }

            if (!sCanProtocolCompatible)
            {
                *txlen=0;
                return 0;
            }
		
		    received_canloader_msg=0; // start to transmit status messages

            // go to Switch On state
            DS402_Controlword.Flags.SwitchOn = 1;
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__CONTROLLER_IDLE: // DS402 Shutdown
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            // Command can be accepted only if current ststus is OPERATION ENABLE or SWITCHED ON 
            if ( (1 != DS402_Statusword.Flags.OperationEnabled ) && (1 != DS402_Statusword.Flags.SwitchedOn ) )
            {
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_DS402_INVALID_STATUS_CHANGE;
                *txlen = 0x0;
                return(0);
            }

            // go to Ready to Switch On state
            //DS402_Controlword.Flags.EnableVoltage = 0;
            DS402_Controlword.Flags.EnableOperation = 0;   
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__GET_CONTROL_MODE:
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            
            txpayload->b[1] = CanIcubProtoGetcontrol_mode();
            if( icubCanProto_controlmode_unknownError == txpayload->b[1])
            {
//                *txlen = 0x1;
//                txpayload->b[0] =  CAN_ERROR_INCONSISTENT_STATE;
                *txlen = 0x0;
                return(0);
            }

            txpayload->b[0] = cmd;
            *txlen = 0x2;

        }break;

        case ICUBCANPROTO_POL_MC_CMD__SET_CONTROL_MODE:
        {
            if(2 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }

            //this command has effect only when i'm in enable operation state
//            if(1 != DS402_Controlword.Flags.EnableOperation)
//            {
////                *txlen = 0x1;
////                txpayload->b[1] = CAN_ERROR_COMMAND_IN_INVALID_STATE;
//                *txlen = 0x0;
//                return(0);
//            }


            if (!sCanProtocolCompatible)
            {
                *txlen=0;
                return 0;
            }

            received_canloader_msg=0; // start to transmit status messages

            if(rxpayload->b[1] != icubCanProto_controlmode_idle)
            {
                DS402_Controlword.Flags.SwitchOn = 1;

                DS402_Controlword.Flags.EnableOperation = 1;
                //let change control mode on fly
                s_controlMode_reset();
            }

            switch(rxpayload->b[1])
            {          
                case icubCanProto_controlmode_openloop:
                {
                    SysStatus.TorqueControl = 0;
                    SysStatus.OpenLoop = 1;
                }break;	 
                case icubCanProto_controlmode_current:
                {
                    SysStatus.OpenLoop = 0;
                    SysStatus.TorqueControl = 1;
                }break;
                case icubCanProto_controlmode_velocity:
                {
                    SysStatus.SpeedControl = 1;
                }break;
                case icubCanProto_controlmode_idle:
                {
                    DS402_Controlword.Flags.EnableOperation = 0; // go to Switched On state
                }break;
                case icubCanProto_controlmode_position:
		            {
                    SysStatus.PositionControl = 1;
		            }break;
                case icubCanProto_controlmode_torque:
                {
                    SysStatus.TorqueSensorLoop = 1;
                }break;
                default:
                {
                    s_controlMode_setDefault();
                }break;
            }

        }break;

        case ICUBCANPROTO_POL_MC_CMD__WRITE_FLASH_MEM:
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
#ifndef CAN_CMD_ALWAYS_ACCEPT
            if ( (1 != DS402_Statusword.Flags.OperationEnabled ) && (1 != DS402_Statusword.Flags.SwitchedOn ) )
            {
              *txlen=0x1;
              txpayload->b[0] =  CAN_ERROR_COMMAND_IN_INVALID_STATE;
              return(0);
            }
#endif
            EepromSave();
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__GET_ADDITIONAL_INFO:
        {
            ;   //todo
        }break;

        case ICUBCANPROTO_POL_MC_CMD__SET_ADDITIONAL_INFO:
        {
            ;   //todo
        }break;
        
