robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto - V2/app-added/can_icubProto_parser.c
        case ICUBCANPROTO_POL_MC_CMD__GET_DESIRED_VELOCITY: 
        {
            ;  //todo 
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__SET_DESIRED_VELOCITY: 
        {
            ;  //todo 
        }break;

        case ICUBCANPROTO_POL_MC_CMD__SET_ENCODER_POSITION: 
        {
            
		// setta l'offset di fasatura 
		Encoder_SyncPulsePosition=(rxpayload->b[2] << 8 | rxpayload->b[1]);  //todo aspetta maggia
        }break;
        
        
        case ICUBCANPROTO_POL_MC_CMD__GET_BOARD_ID: 
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            *txlen = 0x2;
            txpayload->b[0] = cmd;
            txpayload->b[1] = canprotoparser_bid;
        }break;

        case ICUBCANPROTO_POL_MC_CMD__SET_BOARD_ID: 
        {
//            *txlen=0x1;
//             txpayload->b[0] = CAN_PROTO_ERROR_COMMAND_NOT_INPLEMENTED;
              //*txlen=0;
              //return(0);
            
            /* currently it is NOT possible change board can address, 
            so the code below is commented, but it is right. */

            if(2 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen=0;
                return(0);
            }
//#ifndef CAN_CMD_ALWAYS_ACCEPT
//            if ( (1 != DS402_Statusword.Flags.OperationEnabled ) && (1 != DS402_Statusword.Flags.SwitchedOn ) )
//            {
//              *txlen=0x1;
//              txpayload->b[0] =  CAN_ERROR_COMMAND_IN_INVALID_STATE;
//              return(0);
//            }
//#endif
              ApplicationData.EepromHeader.EE_CAN_BoardAddress = rxpayload->b[1];
              canprotoparser_bid = rxpayload->b[1];
              CanIcubProtoTransmitterUpdateBoardId(canprotoparser_bid);
              CanIcubProtoSetFilters(canprotoparser_bid);

              {
                  int i;

                  _memcpy_p2d16(&s_devinfo, 0x15000, sizeof(s_deviceinfo_in_flash_t));

                  _erase_flash(0x15000);

                  s_devinfo.canadr = canprotoparser_bid;

                  s_devinfo.mode   = 1;
                  s_devinfo.dummy0 = 0;
                  s_devinfo.dummy1 = 0xcaac;
                  s_devinfo.crc    = crc16(0xFFFF, &s_devinfo, 64);
                  
                  for (i=0; i<sizeof(s_deviceinfo_in_flash_t); i+=_FLASH_ROW)
                  {
                      _write_flash16(0x15000+i, ((int*)(&s_devinfo))+i/2);
                  }
              }
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__SET_MAX_VELOCITY: 
        {
            ; //aspetta maggia
			//
        }break;

        case ICUBCANPROTO_POL_MC_CMD__GET_MAX_VELOCITY: 
        {
            ; //aspetta maggia
        }break;

        case ICUBCANPROTO_POL_MC_CMD__SET_CURRENT_LIMIT: 
        {
			      if(5 != rxlen)
            {   // incorrect number of parameters
                // *txlen = 0x1;
                // txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
		
	          ////il dato che arriva è espresso in mA va trasformato in IAD della 2FOC (1A 1310)
              //il dato che arriva è espresso in mA va trasformato in IAD della 2FOC (1A=2000)
	          ApplicationData.CurLimit=(rxpayload->b[2] << 8 | rxpayload->b[1])*2;
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__GET_FIRMWARE_VERSION: 
        {
            uint8_t server_can_protocol_major = rxpayload->b[1]; 
            uint8_t server_can_protocol_minor = rxpayload->b[2]; 
            /*uint8_t can_protocol_ack*/ 
            sCanProtocolCompatible = (CAN_PROTOCOL_VERSION_MAJOR == server_can_protocol_major && 
                                      CAN_PROTOCOL_VERSION_MINOR == server_can_protocol_minor); 
            *txlen = 0x8;
            txpayload->b[0] = ICUBCANPROTO_POL_MC_CMD__GET_FIRMWARE_VERSION;
            txpayload->b[1] = icubCanProto_boardType__2foc;
            txpayload->b[2] = FW_VERSION_MAJOR;
            txpayload->b[3] = FW_VERSION_MINOR;
            txpayload->b[4] = FW_VERSION_BUILD;
            txpayload->b[5] = CAN_PROTOCOL_VERSION_MAJOR;
            txpayload->b[6] = CAN_PROTOCOL_VERSION_MINOR;
            txpayload->b[7] = sCanProtocolCompatible; // can_protocol_ack;

            if (!sCanProtocolCompatible)
            {
                // go to fault state
                SysError.CANInvalidProtocol = 1;
                // call fault handler
                FaultConditionsHandler();
            }

        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__SET_CURRENT_PID: 
        {
            SFRAC16 pp, pi, pd, pm; //pm non viene passato dal comando 

            if(7 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            //ControllerGetCurrentDPIDParm(&pp,&pi,&pd,&pm);
            pp = (rxpayload->b[2] << 8 | rxpayload->b[1]);
            pi = (rxpayload->b[4] << 8 | rxpayload->b[3]);
            pd = 0;
            pm = (rxpayload->b[6] << 8 | rxpayload->b[5]);
      

            ControllerSetCurrentDPIDParm(pp,pi,pd,pm);
	        ControllerSetCurrentQPIDParm(pp,pi,pd,pm);
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__GET_CURRENT_PID: 
        {
            signed int p, i, d, m; 
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            
            ControllerGetCurrentDPIDParm(&p, &i, &d, &m);
            txpayload->b[0] = cmd;
            memcpy(&txpayload->b[1], &p, 2);
            memcpy(&txpayload->b[3], &i, 2);
            memcpy(&txpayload->b[5], &d, 2);
            *txlen = 0x7;   
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__SET_VELOCITY_PID: 
        {
            SFRAC16 pp, pi, pd, pm; //pm non viene passato dal comando 
            
            if(7 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            ControllerGetWPIDParm(&pp,&pi,&pd,&pm);
            pp = (rxpayload->b[2] << 8 | rxpayload->b[1]);
            pi = (rxpayload->b[4] << 8 | rxpayload->b[3]);
            pd = (rxpayload->b[6] << 8 | rxpayload->b[5]); 
            ControllerSetWPIDParm(pp,pi,pd,pm);
        }break;
        
