robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto - V2/app-added/can_icubProto_parser.c
        case ICUBCANPROTO_POL_MC_CMD__GET_VELOCITY_PID: 
        {
            signed int p, i, d, m;

            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            ControllerGetWPIDParm(&p, &i, &d, &m);
            txpayload->b[0] = cmd;
            memcpy(&txpayload->b[1], &p, 2);
            memcpy(&txpayload->b[3], &i, 2);
            memcpy(&txpayload->b[5], &d, 2);
            *txlen = 0x7;
        }break;
                
        case ICUBCANPROTO_POL_MC_CMD__SET_DESIRED_CURRENT: 
        {
	        SFRAC16 IqRef;
            if(5 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            
#ifndef CAN_CMD_ALWAYS_ACCEPT
            if ( (1 != DS402_Statusword.Flags.OperationEnabled ) && (1 != DS402_Statusword.Flags.SwitchedOn ) )
            {
//              *txlen=0x1;
//              txpayload->b[0] =  CAN_ERROR_COMMAND_IN_INVALID_STATE;
              *txlen = 0x0;
              return(0);
            }
#endif
           // Torque control references
	         IqRef = (rxpayload->b[2] << 8 | rxpayload->b[1]);
	         if (IqRef>ApplicationData.CurLimit)
               IqRef=ApplicationData.CurLimit;
             else if (IqRef<-ApplicationData.CurLimit)
               IqRef=-ApplicationData.CurLimit;
	         CtrlReferences.qIqRef=IqRef;
           // set reference value for toggling torque
           TorqueTogglingReference = CtrlReferences.qIqRef;

           // Flux control references
           CtrlReferences.qIdRef = (rxpayload->b[4] << 8 | rxpayload->b[3]);  

#ifdef SYNC_2FOC_TO_EMS
            CanIcubProtoTrasmitterSendPeriodicData();          
#endif    
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__GET_DESIRED_CURRENT: 
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            
            *txlen=0x5;
            txpayload->b[0] = cmd;
            memcpy(&txpayload->b[1], &CtrlReferences.qIqRef, 2);
            memcpy(&txpayload->b[3], &CtrlReferences.qIdRef, 2);    
        }break;

        case ICUBCANPROTO_POL_MC_CMD__SET_PERIODIC_MSG_CONTENTS: 
        {
            if(5 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            
            // check data to transmit if in the acceptable range 
            if ( (rxpayload->b[1] < ELEMENTS_IN_PREIODIC_DATA_LIST )
              && (rxpayload->b[2] < ELEMENTS_IN_PREIODIC_DATA_LIST )
              && (rxpayload->b[3] < ELEMENTS_IN_PREIODIC_DATA_LIST )
              && (rxpayload->b[4] < ELEMENTS_IN_PREIODIC_DATA_LIST ))
            {
                // set the data to transmit
                PeriodicMessageContents[0] = rxpayload->b[1];
                PeriodicMessageContents[1] = rxpayload->b[2];
                PeriodicMessageContents[2] = rxpayload->b[3];
                PeriodicMessageContents[3] = rxpayload->b[4];

                // precalculate this here. This is an optimization
                gulpadr1 = (unsigned int*)PeriodicData[PeriodicMessageContents[0]];
                gulpadr2 = (unsigned int*)PeriodicData[PeriodicMessageContents[1]];
                gulpadr3 = (unsigned int*)PeriodicData[PeriodicMessageContents[2]];
                gulpadr4 = (unsigned int*)PeriodicData[PeriodicMessageContents[3]];
            }
            else
            {
              // parameter out of range
//              *txlen=0x1;
//              txpayload->b[0] = CAN_ERROR_PARAMETER_OUT_OF_RANGE;
                *txlen = 0x0;
              return(0);
            }
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__SET_I2T_PARAMS:
        {
            if(5 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            //extract params from the 1st word
             I2Tdata.Param = (rxpayload->b[2] <<8 | rxpayload->b[1]);
             I2Tdata.IThreshold = (rxpayload->b[4] <<8 | rxpayload->b[3]);
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__GET_I2T_PARAMS:
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            *txlen = 5;
            txpayload->b[0] = cmd;
            memcpy(&txpayload->b[1], &I2Tdata.Param, 2); 
            memcpy(&txpayload->b[3], &I2Tdata.IThreshold, 2);
        }break;
        
        default:
        {
            //ICUBPROTO_PAYLOAD_ERROR_SET(txpayload, txlen, CAN_PROTO_ERROR_UNKNOWN_COMMAND);
            *txlen = 0;
            return(0);
        }
    } //end switch
    return(1);
}

static int s_canIcubProtoParser_parse_periodicMsg(unsigned char permsg_type, tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen)
{
#ifndef DESIRED_CURR_IN_PER_MSG_BY_EMS
    //ICUBPROTO_PAYLOAD_ERROR_SET(txpayload, txlen, CAN_PROTO_ERROR_UNKNOWN_COMMAND);
    *txlen = 0;
    return(0);
#else
    switch(permsg_type)
    {
        case ICUBCANPROTO_PER_MC_MSG__EMSTO2FOC_DESIRED_CURRENT:
        {
            if((canprotoparser_bid*2) > rxlen)
            {
                //ICUBPROTO_PAYLOAD_ERROR_SET(txpayload, txlen, CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS);
                *txlen = 0;
                return(0);
            }
             
