robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto - V2/app-added/can_icubProto_parser.c
            // Torque control references
            CtrlReferences.qIdRef = 0;
            CtrlReferences.qIqRef = -rxpayload->w[canprotoparser_bid-1];

            /*
            if (CtrlReferences.qIqRef>ApplicationData.CurLimit)
               CtrlReferences.qIqRef= ApplicationData.CurLimit;
            else if (CtrlReferences.qIqRef<-ApplicationData.CurLimit)
               CtrlReferences.qIqRef=-ApplicationData.CurLimit;
            */
            
            // set reference value for toggling torque
            TorqueTogglingReference = CtrlReferences.qIqRef;
#ifdef SYNC_2FOC_TO_EMS
            //if (!SysError.OverCurrentFailure)
            {
              CanIcubProtoTrasmitterSendPeriodicData();
            }          
#endif   
			*txlen = 0;
			return(1);
        }break;
       
        default:
        {
            //ICUBPROTO_PAYLOAD_ERROR_SET(txpayload, txlen, CAN_PROTO_ERROR_UNKNOWN_COMMAND);
            *txlen = 0;
            return(0);
        }

    }

#endif    
}

static int s_canIcubProtoParser_parse_canLoaderMsg(tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen)
{
    unsigned char cmd;

    cmd = rxpayload->b[0];
    *txlen = 0;
	
	
	switch (cmd)
    {
        case ICUBCANPROTO_BL_BROADCAST: 
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
			
			received_canloader_msg=1; // do not transmit status messages

            *txlen = 5;
            txpayload->b[0] = cmd;
            txpayload->b[1] = icubCanProto_boardType__2foc;
            txpayload->b[2] = FW_VERSION_MAJOR;
            txpayload->b[3] = FW_VERSION_MINOR;
            txpayload->b[4] = FW_VERSION_BUILD;            
        } break;
                
    
        case ICUBCANPROTO_BL_BOARD:
        {
            asm ("reset");    // Jump to bootloader code      
        } break;
    
        case ICUBCANPROTO_BL_GET_ADDITIONAL_INFO:
        {
            ;
        } break;
    
        case ICUBCANPROTO_BL_SET_ADDITIONAL_INFO:
        {
            ;
        } break;
        
                
        default:
        {
            //ICUBPROTO_PAYLOAD_ERROR_SET(txpayload, txlen, CAN_PROTO_ERROR_UNKNOWN_COMMAND);
            *txlen = 0;
            return(0);
        } break;
        
        
    } //end switch

    return(1);    

}
